---
type: InSessionViewSheetSet
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# InSessionViewSheetSet

`Autodesk.Revit.DB.InSessionViewSheetSet` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsAutomatic | — | `public virtual bool IsAutomatic { get ; set ; }` |
| Property | OrderedViewList | — | `public virtual IReadOnlyList < View > OrderedViewList { get ; set ; }` |
| Property | SheetOrganizationId | — | `public virtual ElementId SheetOrganizationId { get ; set ; }` |
| Property | ViewOrganizationId | — | `public virtual ElementId ViewOrganizationId { get ; set ; }` |
| Property | Views | — | `public virtual ViewSet Views { get ; set ; }` |